# Handling Missing Values

## How to Identify missing Values

## df.isnull() - it returns True if values are missing

## How to deal with missing values?
- drop the missing value:
- either drop the entire row : df.dropna('col_name', axis = 0, inplace = True)
- or drop the entire column : df.dropna('col_name', axis = 1, inplace = True)
 + replace the missing values
 + use business understanding
 + Statistical methods - Imputation(Mean, Median, Mode)
 + df['col_name'].fillna(df.col_name.mean(), inplace = True)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [33]:
df = pd.read_csv("C:/Users/Admin/OneDrive - ptit.edu.vn/Desktop/data_miss.csv")
df.head()

  FirstName LastName   Age  Sex preTestScore postTestScore location
0       abc      mno  12.0    m         90.0          65.0      NaN
1       NaN      NaN   NaN  NaN         90.0             ?      NaN
2       ghi      pqr  12.0    f            -          65.0        ?
3       jkl      stu  12.0    f         90.0          62.0      NaN
4       mno      vwx  12.0    m         89.0          63.0      NaN

In [34]:

print(df.shape)

print(df.info())

(5, 7)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   FirstName      4 non-null      object
 1   LastName       4 non-null      object
 2   Age            4 non-null      float64
 3   Sex            4 non-null      object
 4   preTestScore   5 non-null      object
 5   postTestScore  5 non-null      object
 6   location       1 non-null      object
dtypes: float64(1), object(6)
memory usage: 412.0+ bytes
None

In [35]:
# replace missing values to NaN
missing_val = ['n/a', '-', '?']
df = pd.read_csv("C:/Users/Admin/OneDrive - ptit.edu.vn/Desktop/data_miss.csv", na_values = missing_val)

In [36]:
df.head()

  FirstName LastName   Age  Sex  preTestScore  postTestScore  location
0       abc      mno  12.0    m          90.0           65.0       NaN
1       NaN      NaN   NaN  NaN          90.0            NaN       NaN
2       ghi      pqr  12.0    f           NaN           65.0       NaN
3       jkl      stu  12.0    f          90.0           62.0       NaN
4       mno      vwx  12.0    m          89.0           63.0       NaN

In [37]:
df.isnull() # true là NaN

   FirstName  LastName    Age    Sex  preTestScore  postTestScore  location
0      False     False  False  False         False          False      True
1       True      True   True   True         False           True      True
2      False     False  False  False          True          False      True
3      False     False  False  False         False          False      True
4      False     False  False  False         False          False      True

In [38]:
df.isna().sum()

FirstName        1
LastName         1
Age              1
Sex              1
preTestScore     1
postTestScore    1
location         5
dtype: int64

In [39]:
# Columns with at least one missing values
# cột có ít nhất giá trị NaN
df.isnull().any(axis = 0)

FirstName        True
LastName         True
Age              True
Sex              True
preTestScore     True
postTestScore    True
location         True
dtype: bool

In [40]:
# Columns with all missing values tất cả giá trị của cột là NaN
df.isnull().all(axis = 0)

FirstName        False
LastName         False
Age              False
Sex              False
preTestScore     False
postTestScore    False
location          True
dtype: bool

In [41]:
 # nghĩa là location full NaN

In [42]:

#Rows with all missing values
df.isnull().all(axis=1)

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [43]:

# Number of rows with all missing values
df.isnull().all(axis=1).sum()

0

## Missing values Treatment in Columns

In [46]:
# Search percent missing values 

round((df.isnull().sum() / len(df.index) * 100), 2)

FirstName         20.0
LastName          20.0
Age               20.0
Sex               20.0
preTestScore      20.0
postTestScore     20.0
location         100.0
dtype: float64

In [45]:
# đây là phần trăm dữ liệu còn thiếu

In [47]:
df.dropna(axis = 1, how = 'all', inplace = True) 
# how = 'all' nghĩa là cột này full NaN thì xó
round((df.isnull().sum() / len(df.index) * 100), 2)

FirstName        20.0
LastName         20.0
Age              20.0
Sex              20.0
preTestScore     20.0
postTestScore    20.0
dtype: float64

## Missing values Treatment in rows

In [48]:
df[df.isnull().sum(axis = 1) >= 4]

  FirstName LastName  Age  Sex  preTestScore  postTestScore
1       NaN      NaN  NaN  NaN          90.0            NaN

In [49]:

# retaining the rows having <= 4 NaNs
df = df[df.isnull().sum(axis=1) <= 4]

# look at the summary again
round(100*(df.isnull().sum()/len(df.index)), 2)

FirstName         0.0
LastName          0.0
Age               0.0
Sex               0.0
preTestScore     25.0
postTestScore     0.0
dtype: float64

In [50]:
df.head()

  FirstName LastName   Age Sex  preTestScore  postTestScore
0       abc      mno  12.0   m          90.0           65.0
2       ghi      pqr  12.0   f           NaN           65.0
3       jkl      stu  12.0   f          90.0           62.0
4       mno      vwx  12.0   m          89.0           63.0

In [51]:

df['preTestScore'].describe()

count     3.000000
mean     89.666667
std       0.577350
min      89.000000
25%      89.500000
50%      90.000000
75%      90.000000
max      90.000000
Name: preTestScore, dtype: float64

In [52]:
df['preTestScore'].isna().sum()

1

In [53]:
len(df['preTestScore'])

4

In [54]:
df.head(15)

  FirstName LastName   Age Sex  preTestScore  postTestScore
0       abc      mno  12.0   m          90.0           65.0
2       ghi      pqr  12.0   f           NaN           65.0
3       jkl      stu  12.0   f          90.0           62.0
4       mno      vwx  12.0   m          89.0           63.0

In [55]:
df['preTestScore'].fillna(df['preTestScore'].mean(), inplace = True)

round(100*(df.isnull().sum()/len(df.index)), 2)

C:\Users\Admin\AppData\Local\Temp\ipykernel_32004\568777320.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['preTestScore'].fillna(df['preTestScore'].mean(), inplace = True)

FirstName        0.0
LastName         0.0
Age              0.0
Sex              0.0
preTestScore     0.0
postTestScore    0.0
dtype: float64

In [56]:
df.head()

  FirstName LastName   Age Sex  preTestScore  postTestScore
0       abc      mno  12.0   m     90.000000           65.0
2       ghi      pqr  12.0   f     89.666667           65.0
3       jkl      stu  12.0   f     90.000000           62.0
4       mno      vwx  12.0   m     89.000000           63.0

In [57]:
# thay thế giá trị nan ở pretestScore bằng mean của nó

# Missing value Imputation using KNN Imputer

In [62]:
missing_val = ['n/a', '-', '?']

df = pd.read_csv("C:/Users/Admin/OneDrive - ptit.edu.vn/Desktop/data_miss.csv", na_values=missing_val)

In [63]:
df.head()

  FirstName LastName   Age  Sex  preTestScore  postTestScore  location
0       abc      mno  12.0    m          90.0           65.0       NaN
1       NaN      NaN   NaN  NaN          90.0            NaN       NaN
2       ghi      pqr  12.0    f           NaN           65.0       NaN
3       jkl      stu  12.0    f          90.0           62.0       NaN
4       mno      vwx  12.0    m          89.0           63.0       NaN

In [64]:
df.isnull().sum()

FirstName        1
LastName         1
Age              1
Sex              1
preTestScore     1
postTestScore    1
location         5
dtype: int64

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   FirstName      4 non-null      object
 1   LastName       4 non-null      object
 2   Age            4 non-null      float64
 3   Sex            4 non-null      object
 4   preTestScore   4 non-null      float64
 5   postTestScore  4 non-null      float64
 6   location       0 non-null      float64
dtypes: float64(4), object(3)
memory usage: 412.0+ bytes

In [66]:
df_num = df.select_dtypes(include = ["int64", "float64"])

df_num.head()

    Age  preTestScore  postTestScore  location
0  12.0          90.0           65.0       NaN
1   NaN          90.0            NaN       NaN
2  12.0           NaN           65.0       NaN
3  12.0          90.0           62.0       NaN
4  12.0          89.0           63.0       NaN

In [68]:
df_num = df_num.drop(['location'], axis = 1)
df_num.head()

    Age  preTestScore  postTestScore
0  12.0          90.0           65.0
1   NaN          90.0            NaN
2  12.0           NaN           65.0
3  12.0          90.0           62.0
4  12.0          89.0           63.0

In [70]:
from sklearn.impute import KNNImputer

knn_imputer = KNNImputer(n_neighbors= 3 )  
# sử dụng 3 hàng gần nhát để làm việc 

df_knn_imp = pd.DataFrame(knn_imputer.fit_transform(df_num),
                          columns = df_num.columns,
                          index = df_num.index)

df_knn_imp.head()

    Age  preTestScore  postTestScore
0  12.0     90.000000      65.000000
1  12.0     90.000000      63.333333
2  12.0     89.666667      65.000000
3  12.0     90.000000      62.000000
4  12.0     89.000000      63.000000

In [74]:
# method 2
from sklearn.impute import SimpleImputer

mean_imputer = SimpleImputer(strategy='mean')

X_imputed = mean_imputer.fit_transform(df_num)
X_imputed

array([[12.  , 90.  , 65.  ],
       [12.  , 90.  , 63.75],
       [12.  , 89.75, 65.  ],
       [12.  , 90.  , 62.  ],
       [12.  , 89.  , 63.  ]])

In [75]:
import pandas as pd
import numpy as np

# Ví dụ dữ liệu
df = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [5, np.nan, 7, 8]
})

# Tính mean của cột B và điền vào chỗ NaN

df['B'].fillna(df['B'].mean(), inplace = True)

df.head()

C:\Users\Admin\AppData\Local\Temp\ipykernel_32004\3309360201.py:12: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['B'].fillna(df['B'].mean(), inplace = True)

     A         B
0  1.0  5.000000
1  2.0  6.666667
2  NaN  7.000000
3  4.0  8.000000

In [76]:

from sklearn.impute import SimpleImputer

mean_imputer = SimpleImputer(strategy='mean')
# strategy = 'mean', 'median', 'most_frequent'

df_mean_imp = pd.DataFrame(mean_imputer.fit_transform(df_num),
                         columns=df_num.columns,
                         index=df_num.index)

df_mean_imp.head()

    Age  preTestScore  postTestScore
0  12.0         90.00          65.00
1  12.0         90.00          63.75
2  12.0         89.75          65.00
3  12.0         90.00          62.00
4  12.0         89.00          63.00